---
kind: method
id: M:Autodesk.Revit.DB.BindingMap.Clear
source: html/0a9df754-4dc0-e5c0-b7f1-73bed8e4e192.htm
---
# Autodesk.Revit.DB.BindingMap.Clear Method

This method is used to remove all the items in the map.

## Syntax (C#)
```csharp
public override void Clear()
```

## Remarks
The method Clear inherited from base class is not permitted for this class.
A Autodesk::Revit::Exceptions::InvalidOperationException will be thrown.